const WORDS = [
    // أماكن
    "مدرسة", "مطار", "مسجد", "شاطئ", "سوق", "مكتبة", "غابة", "سينما", "مطعم", "متحف",
    "مخبز", "مستشفى", "ملعب", "حديقة", "مقهى", "جامعة", "محكمة", "سجن", "ميناء", "محطة بنزين",
  
    // مهن
    "طبيب", "مهندس", "شرطي", "طباخ", "معلم", "نجار", "ميكانيكي", "محامي", "صحفي", "مزارع",
    "سائق تاكسي", "كهربائي", "جندي", "صيدلي", "مترجم", "مخرج سينمائي", "موسيقي", "ممثل", "رسام", "إطفائي",
  
    // أشياء
    "هاتف", "كمبيوتر", "مفتاح", "كتاب", "كرسي", "طاولة", "قلم", "ساعة", "كاميرا", "مروحة",
    "شاشة", "خريطة", "نظارات", "مصباح", "مظلة", "حقيبة", "ممحاة", "دفتر", "راديو", "لوحة مفاتيح",
  
    // أطعمة
    "بيتزا", "كسكسي", "شوربة", "شاورما", "خبز", "برغر", "مكرونة", "طاجين", "رز", "بقلاوة",
    "شوكولاتة", "مثلجات", "عصير", "قهوة", "شاي", "بيض", "جبن", "زيتون", "تمر", "كعك",
  
    // شخصيات
    "سوبرمان", "شرلوك هولمز", "الملك سلمان", "أينشتاين", "محمد صلاح", "هاري بوتر", "مارادونا", "أوباما", "الرسول محمد", "أم كلثوم",
    "الملكة إليزابيث", "تشي جيفارا", "نابليون", "نيلسون مانديلا", "ميسي", "توم وجيري", "فرعون", "الملك آرثر", "علاء الدين", "بيكاسو"
  ];
  